backend/app/controllers/scores_controller.rb

    def index
        scores = Score.all
---
SELECT "scores".* FROM "scores"

    def create
        /Save User and Score at same time/
        user = User.find_or_create_by(user_params)
        score = user.scores.build(score_params)
        if user.valid? && score.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Geo"], ["created_at", "2021-02-03 21:55:07.597723"], ["updated_at", "2021-02-03 21:55:07.597723"]]
INSERT INTO "scores" ("points", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["points", 1], ["created_at", "2021-02-03 21:55:07.759161"], ["updated_at", "2021-02-03 21:55:07.759161"], ["user_id", 3]]