backend/app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Thomas"], ["created_at", "2021-01-29 02:05:12.794821"], ["updated_at", "2021-01-29 02:05:12.794821"]]

    def destroy
        user = User.find_by_id(params[:id])
        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]